
data("HairEyeColor")


hair_eye_table <- xtabs(Freq ~ Sex + Hair + Eye, data = HairEyeColor)

hair_eye_matrix <- as.matrix(hair_eye_table)

chi_square_test <- chisq.test(hair_eye_matrix)

print(chi_square_test)


# 
# Отримані результати тесту Хі-квадрат показують 
# наявність статистично значущої залежності між 
# коліром волосся і коліром очей. P-значення (p-value) 
# менше за будь-яку зазвичай прийняту критичну альфу 
# (навіть наближено до 0), що означає, що є дуже сильні 
# докази на кореляцію між цими двома ознаками.
# 
# У такому контексті, ви можете відхилити нульову 
# гіпотезу і припустити, що колір волосся впливає
# на колір очей у досліджуваному наборі даних.