# Завантажте дані про тривалість сну
data("sleep")

# Розділіть дані на два типи снодійних: 1 і 2
sleep_group1 <- subset(sleep, group == 1)
sleep_group2 <- subset(sleep, group == 2)
# Використайте тест Фішера для порівняння дисперсій
fisher_test <- var.test(extra ~ group, data = sleep)

# Виведіть результат тесту
print(fisher_test)
# 
# Результат тесту Фішера показує, що ми не маємо достатніх доказів для 
# відхилення нульової гіпотези, 
# що відношення дисперсій між двома групами дорівнює 
# одиниці. P-значення становить 0.7427, що є значно більшим 
# за зазвичай прийняту критичну альфу 0.05.
# 
# З іншого боку, ви маємо овірчий інтервал від 0.198297 до 3.214123 
# для відношення дисперсій між групами. Оскільки цей інтервал 
# включає значення 1, це також свідчить про те, що немає підстав 
# вважати, що відношення дисперсій відрізняється від одиниці.
# 
# Отже, на підставі результатів тесту Фішера, можна вважати, 
# що відношення дисперсій тривалості сну при вживанні двох типів 
# снодійних менше одиниці.