# Кореляція Пірсона
cor_p <- cor(data[, 2:4], method = "pearson")
# Кореляція Спірмена
cor_s <- cor(data[, 2:4], method = "spearman")
# Кореляція Кендалла
cor_k <- cor(data[, 2:4], method = "kendall")
print("Кореляція Пірсона:")
print(cor_p)
print("Кореляція Спірмена:")
print(cor_s)
print("Кореляція Кендалла:")
print(cor_k)


# Перевірка статистичної значущості кореляції Пірсона між Ethereum і TSLA
cor_test <- cor.test(data$Ethereum, data$TSLA, method = "pearson")

print("Тест статистичної значущості кореляції Пірсона:")
print(cor_test)

# Результати тесту Пірсона для кореляції 
# між Ethereum і TSLA вказують на наявність 
# статистично значущої кореляції. Отже, кореляція 
# між цими двома змінними є значущою. Пірсонівський
# коефіцієнт кореляції (cor) дорівнює 0.6828704, що 
# свідчить про помірну позитивну кореляцію між Ethereum і 
# TSLA. Також, довірчий інтервал для цієї кореляції 
# складається з значень від 0.6428408 до 0.7191805 
# на рівні значущості 0.05.
# 
# Значення p-value < 2.2e-16 вказує на дуже 
# високу статистичну значущість кореляції, 
# оскільки воно надзвичайно мале. Таким чином, 
# ви можете вважати цю кореляцію статистично значущою та важливою.